ETL.org
#+title: ETL
#+OPTIONS: toc:nil

* Table of contents:
** [[Extract][Extract]]
*** [[Logon][Logon]]
*** [[Amo api methods][Amo api methods]]
**** [[Leads][Leads]]
**** [[Statuses][Statuses]]
**** [[Notes][Notes]]
**** [[Pipelines][Pipelines]]
**** [[Users][Users]]
*** [[Extraction][Extraction]]
*** [[Test][Test]]
** [[Transform][Transform]]
*** [[Transform Base][Transform Base]]
*** [[Transform Users][Transform Users]]
*** [[Transform Leads][Transform Leads]]
*** [[Transform Statuses][Transform Statuses]]
*** [[Transform all][Transform all]]
** [[Load][Load]]
** [[ETL's themselves][ETL's themselves]]
** [[Shell to rule them all][Shell to rule them all]]
* Extract
This is the phase we will be talking to AmoCRM api with requests calls.
The idea is to download all the entities and write them page per page to the according folder in Json format.
This will be basically a list of dictionaries, easily handled by python.
