ETL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-23 Mon 14:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ETL</title>
<meta name="author" content="Georgy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ETL</h1>

<div id="outline-container-org440b557" class="outline-2">
<h2 id="org440b557"><span class="section-number-2">1.</span> Table of contents:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6b7291f" class="outline-3">
<h3 id="org6b7291f"><span class="section-number-3">1.1.</span> <a href="#orge083211">Extract</a></h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org8bc5826" class="outline-4">
<h4 id="org8bc5826"><span class="section-number-4">1.1.1.</span> <a href="#org633169f">Logon</a></h4>
</div>
<div id="outline-container-orge1cdb3b" class="outline-4">
<h4 id="orge1cdb3b"><span class="section-number-4">1.1.2.</span> <a href="#orgb1b4ae0">Amo api methods</a></h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org5fdaeb7"></a><a href="#orge9555be">Leads</a><br /></li>
<li><a id="org34e0cbe"></a><a href="#org72a3460">Statuses</a><br /></li>
<li><a id="org0e22547"></a><a href="#orgf55006c">Notes</a><br /></li>
<li><a id="org1435f0b"></a><a href="#orge6d30aa">Pipelines</a><br /></li>
<li><a id="orgee92400"></a><a href="#orge910acc">Users</a><br /></li>
</ol>
</div>
<div id="outline-container-org568d01a" class="outline-4">
<h4 id="org568d01a"><span class="section-number-4">1.1.3.</span> <a href="#org4bfea47">Extraction</a></h4>
</div>
<div id="outline-container-orgaaa8191" class="outline-4">
<h4 id="orgaaa8191"><span class="section-number-4">1.1.4.</span> <a href="#orge5cecbf">Test</a></h4>
</div>
</div>
<div id="outline-container-orgd2e1ccb" class="outline-3">
<h3 id="orgd2e1ccb"><span class="section-number-3">1.2.</span> <a href="#org5bcc882">Transform</a></h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgdf9306d" class="outline-4">
<h4 id="orgdf9306d"><span class="section-number-4">1.2.1.</span> <a href="#org2dc8f79">Transform Base</a></h4>
</div>
<div id="outline-container-orga5f1283" class="outline-4">
<h4 id="orga5f1283"><span class="section-number-4">1.2.2.</span> <a href="#org8ca0220">Transform Users</a></h4>
</div>
<div id="outline-container-orgb27aff0" class="outline-4">
<h4 id="orgb27aff0"><span class="section-number-4">1.2.3.</span> <a href="#org77a5c83">Transform Leads</a></h4>
</div>
<div id="outline-container-org82ef899" class="outline-4">
<h4 id="org82ef899"><span class="section-number-4">1.2.4.</span> <a href="#org9f7a948">Transform Statuses</a></h4>
</div>
<div id="outline-container-orgb82b71d" class="outline-4">
<h4 id="orgb82b71d"><span class="section-number-4">1.2.5.</span> <a href="#orgc4beb5a">Transform all</a></h4>
</div>
</div>
<div id="outline-container-org4409d3a" class="outline-3">
<h3 id="org4409d3a"><span class="section-number-3">1.3.</span> <a href="#orgfeabf0e">Load</a></h3>
</div>
<div id="outline-container-org350ef7b" class="outline-3">
<h3 id="org350ef7b"><span class="section-number-3">1.4.</span> <a href="#org118a7df">ETL&rsquo;s themselves</a></h3>
</div>
<div id="outline-container-orgc42a7ad" class="outline-3">
<h3 id="orgc42a7ad"><span class="section-number-3">1.5.</span> <a href="#orge6c56b6">Shell to rule them all</a></h3>
</div>
</div>
<div id="outline-container-orge083211" class="outline-2">
<h2 id="orge083211"><span class="section-number-2">2.</span> Extract</h2>
<div class="outline-text-2" id="text-2">
<p>
This is the phase we will be talking to AmoCRM api with requests calls.
The idea is to download all the entities and write them page per page to the according folder in Json format.
This will be basically a list of dictionaries, easily handled by python.
</p>
</div>
