ETL.org
** Logon
First, we need to specify the logon information that we will use to connect to amo.
To make it reproducible for multiple amocm entities, we'll create a class.
We also want this class to automatically get the code from system environment, if the code was specified.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/logon.py
import requests
import json
from os import environ, path, makedirs
from loguru import logger


class Tokens:

    def __init__(self, id_, secret, subdomain, redirect):
        self.logon_data = {
            "client_id": id_,
            "client_secret": secret,
            "redirect_uri": redirect,
            "subdomain": subdomain
        }
        self.subdomain = subdomain
        self.path = f"tokens/{subdomain}"
        self.url = f"https://{subdomain}.amocrm.ru/oauth2/access_token"
        try:
            self.code = environ["CODE"]
        except KeyError:
            self.code = None


    def check_folder(self):
        if path.isdir(self.path) == False:
            makedirs(self.path)


    def get(self):
        if self.code is not None:
            self.logon_data["code"] = self.code
            self.logon_data["grant_type"] = "authorization_code"

            data = self.logon_data
            r = requests.post(self.url, data=data)
            return r
        logger.critical("You need to provide code!")


    def store(self, dict_, type_):
        self.check_folder()
        with open(f"{self.path}/{type_}.txt", 'w') as f:
            f.write(dict_[type_])


    def init(self):
        r = self.get()
        dict_ = json.loads(r.text)
        self.store(dict_, 'refresh_token')
        self.store(dict_, 'access_token')


    def refresh(self):
        file_ = f"{self.path}/refresh_token.txt"
        if path.exists(file_):
            with open(file_, 'r') as f:
                refresh_token = f.read()
            self.logon_data["grant_type"] = "refresh_token"
            self.logon_data["refresh_token"] = refresh_token
            r = requests.post(self.url, self.logon_data)
            dict_ = json.loads(r.text)
            try:
                self.store(dict_, 'access_token')
                self.store(dict_, 'refresh_token')
            except KeyError:
                logger.critical(dict_)

        else:
            self.init()


    def provide_access(self):
        self.refresh()
        file_ = f"{self.path}/access_token.txt"
        with open(file_, 'r') as f:
            self.access_token = f.read()
        return self.access_token

#+end_src

Than we need to pass our information to that class.
It's generally a good idea to store it in a separate file that will not be synchronized with ~git~.

#+begin_src jupyter-python :session localhost :kernel amo20
from setup import amo20
from os import environ

# del environ["CODE"]
# access_token = amo20.provide_access()
amo20.refresh()
#+end_src

