ETL.html
<div id="outline-container-org633169f" class="outline-3">
<h3 id="org633169f"><span class="section-number-3">2.1.</span> Logon</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First, we need to specify the logon information that we will use to connect to amo.
To make it reproducible for multiple amocm entities, we&rsquo;ll create a class.
We also want this class to automatically get the code from system environment, if the code was specified.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> requests
<span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> os <span style="color: #e67e80;">import</span> environ, path, makedirs
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger


<span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Tokens</span>:

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, id_, secret, subdomain, redirect):
        <span style="color: #e67e80;">self</span>.logon_data = {
            <span style="color: #a7c080;">"client_id"</span>: id_,
            <span style="color: #a7c080;">"client_secret"</span>: secret,
            <span style="color: #a7c080;">"redirect_uri"</span>: redirect,
            <span style="color: #a7c080;">"subdomain"</span>: subdomain
        }
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">subdomain</span> = subdomain
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">path</span> = f<span style="color: #a7c080;">"tokens/</span>{subdomain}<span style="color: #a7c080;">"</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/oauth2/access_token"</span>
        <span style="color: #e67e80;">try</span>:
            <span style="color: #e67e80;">self</span>.code = environ[<span style="color: #a7c080;">"CODE"</span>]
        <span style="color: #e67e80;">except</span> <span style="color: #a7c080;">KeyError</span>:
            <span style="color: #e67e80;">self</span>.code = <span style="color: #83c092;">None</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">check_folder</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">if</span> path.isdir(<span style="color: #e67e80;">self</span>.path) == <span style="color: #83c092;">False</span>:
            makedirs(<span style="color: #e67e80;">self</span>.path)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">get</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">if</span> <span style="color: #e67e80;">self</span>.code <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            <span style="color: #e67e80;">self</span>.logon_data[<span style="color: #a7c080;">"code"</span>] = <span style="color: #e67e80;">self</span>.code
            <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">logon_data</span>[<span style="color: #a7c080;">"grant_type"</span>] = <span style="color: #a7c080;">"authorization_code"</span>

            <span style="color: #7fbbb3;">data</span> = <span style="color: #e67e80;">self</span>.logon_data
            <span style="color: #7fbbb3;">r</span> = requests.post(<span style="color: #e67e80;">self</span>.url, data=data)
            <span style="color: #e67e80;">return</span> r
        logger.critical(<span style="color: #a7c080;">"You need to provide code!"</span>)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">store</span>(<span style="color: #e67e80;">self</span>, dict_, type_):
        <span style="color: #e67e80;">self</span>.check_folder()
        <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(f<span style="color: #a7c080;">"</span>{<span style="color: #e67e80;">self</span>.path}<span style="color: #a7c080;">/</span>{type_}<span style="color: #a7c080;">.txt"</span>, <span style="color: #a7c080;">'w'</span>) <span style="color: #e67e80;">as</span> f:
            f.write(dict_[type_])


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">init</span>(<span style="color: #e67e80;">self</span>):
        r = <span style="color: #e67e80;">self</span>.get()
        dict_ = json.loads(r.text)
        <span style="color: #e67e80;">self</span>.store(dict_, <span style="color: #a7c080;">'refresh_token'</span>)
        <span style="color: #e67e80;">self</span>.store(dict_, <span style="color: #a7c080;">'access_token'</span>)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">refresh</span>(<span style="color: #e67e80;">self</span>):
        file_ = f<span style="color: #a7c080;">"</span>{<span style="color: #e67e80;">self</span>.path}<span style="color: #a7c080;">/refresh_token.txt"</span>
        <span style="color: #e67e80;">if</span> path.exists(file_):
            <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(file_, <span style="color: #a7c080;">'r'</span>) <span style="color: #e67e80;">as</span> f:
                refresh_token = f.read()
            <span style="color: #e67e80;">self</span>.logon_data[<span style="color: #a7c080;">"grant_type"</span>] = <span style="color: #a7c080;">"refresh_token"</span>
            <span style="color: #e67e80;">self</span>.logon_data[<span style="color: #a7c080;">"refresh_token"</span>] = refresh_token
            r = requests.post(<span style="color: #e67e80;">self</span>.url, <span style="color: #e67e80;">self</span>.logon_data)
            dict_ = json.loads(r.text)
            <span style="color: #e67e80;">try</span>:
                <span style="color: #e67e80;">self</span>.store(dict_, <span style="color: #a7c080;">'access_token'</span>)
                <span style="color: #e67e80;">self</span>.store(dict_, <span style="color: #a7c080;">'refresh_token'</span>)
            <span style="color: #e67e80;">except</span> <span style="color: #a7c080;">KeyError</span>:
                logger.critical(dict_)

        <span style="color: #e67e80;">else</span>:
            <span style="color: #e67e80;">self</span>.init()


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">provide_access</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">self</span>.refresh()
        file_ = f<span style="color: #a7c080;">"</span>{<span style="color: #e67e80;">self</span>.path}<span style="color: #a7c080;">/access_token.txt"</span>
        <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(file_, <span style="color: #a7c080;">'r'</span>) <span style="color: #e67e80;">as</span> f:
            <span style="color: #e67e80;">self</span>.access_token = f.read()
        logger.success(<span style="color: #a7c080;">"logged on!"</span>)
        <span style="color: #e67e80;">return</span> <span style="color: #e67e80;">self</span>.access_token

</pre>
</div>

<p>
Than we need to pass our information to that class.
It&rsquo;s generally a good idea to store it in a separate file that will not be synchronized with <code>git</code>.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> os <span style="color: #e67e80;">import</span> environ

<span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">del environ["CODE"]</span>
<span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">access_token = amo20.provide_access()</span>
amo20.refresh()
</pre>
</div>
</div>
</div>
