ETL.org
** Amo api methods

OK, let's put away our *etl* file for the moment and return to setting up things.
Next thing we need to do is specify method we're going to call *amocrm* api.

We'll be using ~requests~ library for all our calls, all we need is to use the correct *url* for each entity.
As a rule, all the calls to amo api are done like:

https://$SUBDOMAIN.amocrm.ru/api/v4/$ENTITY?$PARAMETERS

Some of the entities will have /sub-entities/ in them, and sub-entity can also can have sub-types.
E.g. *incoming calls* are sub-type for *notes*, which is /sub-entity/ to *leads*.
Crazy stuff, isn't it?

Anyway, let's define a basic class for calling api:

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
from dateutil import parser # that's because of amo datetime filters

class Base:
    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/"


    def to_unix_timestamp(self, timestamp):
        """This function converts any datetime string to Unix format
            required by Amo to filter"""
        time_ = parser.parse(timestamp)
        return str(int(time_.timestamp()))


    def created_at(self, at_=None, from_=None):
        if at_ is not None:
            at_ = self.to_unix_timestamp(at_)
            self.url += f"&filter[created_at]={at_}"
        elif from_ is not None:
            from_ = self.to_unix_timestamp(from_)
            self.url += f"&filter[created_at][from]={from_}"
        return self


    def updated_at(self, at_=None, from_=None):
        if at_ is not None:
            at_ = self.to_unix_timestamp(at_)
            self.url += f"&filter[updated_at]={at_}"
        elif from_ is not None:
            from_ = self.to_unix_timestamp(from_)
            self.url += f"&filter[updated_at][from]={from_}"
        return self
#+end_src

Now we need to specify class for each entity that we need.
The list of entities is:
*** Leads
Leads are the most difficult entity because it has custom fields, which can be different for each lead.
We'll deal with them on the [[Transform]] stage.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Leads(Base):
    truename = "leads"
    basename = "leads"
    entity = "leads"


    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity + "?"


    def filter(self):
        pass

#+end_src

*** Statuses
By statuses we mean here ~lead_status_changed~ entity which is sub-type for events.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class  Events(Base):
    entity = "events"
    truename = "statuses"
    basename = "events"

    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity + "?"
#+end_src

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Statuses(Events):
    sub_type = "?filter[type]=lead_status_changed"


    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity\
            + self.sub_type
#+end_src

*** Notes
Notes are sub-entity of [[Leads]], while calls are sub-type of Notes.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Notes(Leads):
    truename = "notes"
    basename = "notes"
    sub_entity = "/notes"

    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity\
            + self.sub_entity + "?"
#+end_src

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Calls(Notes):
    truename = "calls"
    sub_type = "?filter[note_type]=call_in"


    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity\
            + self.sub_entity + self.sub_type

#+end_src

