ETL.html

<div id="outline-container-orgb1b4ae0" class="outline-3">
<h3 id="orgb1b4ae0"><span class="section-number-3">2.2.</span> Amo api methods</h3>
<div class="outline-text-3" id="text-2-2">
<p>
OK, let&rsquo;s put away our <b>etl</b> file for the moment and return to setting up things.
Next thing we need to do is specify method we&rsquo;re going to call <b>amocrm</b> api.
</p>

<p>
We&rsquo;ll be using <code>requests</code> library for all our calls, all we need is to use the correct <b>url</b> for each entity.
As a rule, all the calls to amo api are done like:
</p>

<p>
<a href="https://$subdomain.amocrm.ru/api/v4/$ENTITY?$PARAMETERS">https://$subdomain.amocrm.ru/api/v4/$ENTITY?$PARAMETERS</a>
</p>

<p>
Some of the entities will have <i>sub-entities</i> in them, and sub-entity can also can have sub-types.
E.g. <b>incoming calls</b> are sub-type for <b>notes</b>, which is <i>sub-entity</i> to <b>leads</b>.
Crazy stuff, isn&rsquo;t it?
</p>

<p>
Anyway, let&rsquo;s define a basic class for calling api:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">from</span> dateutil <span style="color: #e67e80;">import</span> parser <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">that's because of amo datetime filters</span>

<span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Base</span>:
    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.url = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">to_unix_timestamp</span>(<span style="color: #e67e80;">self</span>, timestamp):
        <span style="color: #a7c080;">"""This function converts any datetime string to Unix format</span>
<span style="color: #a7c080;">            required by Amo to filter"""</span>
        <span style="color: #7fbbb3;">time_</span> = parser.parse(timestamp)
        <span style="color: #e67e80;">return</span> <span style="color: #83c092;">str</span>(<span style="color: #83c092;">int</span>(time_.timestamp()))


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">created_at</span>(<span style="color: #e67e80;">self</span>, at_=<span style="color: #83c092;">None</span>, from_=<span style="color: #83c092;">None</span>):
        <span style="color: #e67e80;">if</span> at_ <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            at_ = <span style="color: #e67e80;">self</span>.to_unix_timestamp(at_)
            <span style="color: #e67e80;">self</span>.url += f<span style="color: #a7c080;">"&amp;filter[created_at]=</span>{at_}<span style="color: #a7c080;">"</span>
        <span style="color: #e67e80;">elif</span> from_ <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            from_ = <span style="color: #e67e80;">self</span>.to_unix_timestamp(from_)
            <span style="color: #e67e80;">self</span>.url += f<span style="color: #a7c080;">"&amp;filter[created_at][from]=</span>{from_}<span style="color: #a7c080;">"</span>
        <span style="color: #e67e80;">return</span> <span style="color: #e67e80;">self</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">updated_at</span>(<span style="color: #e67e80;">self</span>, at_=<span style="color: #83c092;">None</span>, from_=<span style="color: #83c092;">None</span>):
        <span style="color: #e67e80;">if</span> at_ <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            at_ = <span style="color: #e67e80;">self</span>.to_unix_timestamp(at_)
            <span style="color: #e67e80;">self</span>.url += f<span style="color: #a7c080;">"&amp;filter[updated_at]=</span>{at_}<span style="color: #a7c080;">"</span>
        <span style="color: #e67e80;">elif</span> from_ <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            from_ = <span style="color: #e67e80;">self</span>.to_unix_timestamp(from_)
            <span style="color: #e67e80;">self</span>.url += f<span style="color: #a7c080;">"&amp;filter[updated_at][from]=</span>{from_}<span style="color: #a7c080;">"</span>
        <span style="color: #e67e80;">return</span> <span style="color: #e67e80;">self</span>
</pre>
</div>

<p>
Now we need to specify class for each entity that we need.
The list of entities is:
</p>
</div>
<div id="outline-container-orge9555be" class="outline-4">
<h4 id="orge9555be"><span class="section-number-4">2.2.1.</span> Leads</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Leads are the most difficult entity because it has custom fields, which can be different for each lead.
We&rsquo;ll deal with them on the <a href="#org5bcc882">3</a> stage.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Leads</span>(Base):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"leads"</span>
    <span style="color: #7fbbb3;">basename</span> = <span style="color: #a7c080;">"leads"</span>
    <span style="color: #7fbbb3;">entity</span> = <span style="color: #a7c080;">"leads"</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity + <span style="color: #a7c080;">"?"</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">filter</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">pass</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org72a3460" class="outline-4">
<h4 id="org72a3460"><span class="section-number-4">2.2.2.</span> Statuses</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
By statuses we mean here <code>lead_status_changed</code> entity which is sub-type for events.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span>  <span style="color: #a7c080;">Events</span>(Base):
    <span style="color: #7fbbb3;">entity</span> = <span style="color: #a7c080;">"events"</span>
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"statuses"</span>
    <span style="color: #7fbbb3;">basename</span> = <span style="color: #a7c080;">"events"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity + <span style="color: #a7c080;">"?"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Statuses</span>(Events):
    <span style="color: #7fbbb3;">sub_type</span> = <span style="color: #a7c080;">"?filter[type]=lead_status_changed"</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity\
            + <span style="color: #e67e80;">self</span>.sub_type
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf55006c" class="outline-4">
<h4 id="orgf55006c"><span class="section-number-4">2.2.3.</span> Notes</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Notes are sub-entity of <a href="#orge9555be">2.2.1</a>, while calls are sub-type of Notes.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Notes</span>(Leads):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"notes"</span>
    <span style="color: #7fbbb3;">basename</span> = <span style="color: #a7c080;">"notes"</span>
    <span style="color: #7fbbb3;">sub_entity</span> = <span style="color: #a7c080;">"/notes"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity\
            + <span style="color: #e67e80;">self</span>.sub_entity + <span style="color: #a7c080;">"?"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Calls</span>(Notes):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"calls"</span>
    <span style="color: #7fbbb3;">sub_type</span> = <span style="color: #a7c080;">"?filter[note_type]=call_in"</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity\
            + <span style="color: #e67e80;">self</span>.sub_entity + <span style="color: #e67e80;">self</span>.sub_type

</pre>
</div>
</div>
</div>
