ETL.org
*** Pipelines
Pipelines are sub-entity for [[Leads]]  and contain status names in themselves

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Pipelines(Leads):
    truename = "pipelines"
    basename = "pipelines"
    sub_entity = "/pipelines"

    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity\
            + self.sub_entity + "?"
#+end_src

*** Users
Users are stand-alone entity.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle amo/entities.py
class Users(Base):
    truename = "users"
    entity = "users"
    basename = "users"
    def __init__(self, subdomain):
        self.url = f"https://{subdomain}.amocrm.ru/api/v4/" + self.entity + "?"
#+end_src
** Extraction
Now, when we have all entities described as API methods, we can start extracting them.
For that we'll create some more classes.
Basically our the only method we need is just extract all the entities from Amo, with filters applied.
Because we defined filters as a base method in previous chapter, we can now just go ahead and define extraction method.

Firstly, of course we need to log in, so this will be an attribute of our base class.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle extract.py
import requests
import json
from requests.adapters import HTTPAdapter
from amo.logon import Tokens
from loguru import logger


class Extract:
    session = requests.Session()

    def __init__(self, tokens, entity):
        access_token = tokens.provide_access()
        header = {"Authorization": "Bearer " + access_token}
        self.session.headers.update(header)
        # And to prevent amo from dropping connection:
        self.session.mount('https://', HTTPAdapter(max_retries=5))
        self.basename = entity.basename
        self.truename = entity.truename        # name for writing and further pr...
        self.amo = tokens.subdomain
        self.url = entity.url


    def write(self, counter, content):
        with open(f'temp_data/{self.amo}/{self.truename}/{counter}.json', 'w',
                  encoding='utf-8') as f:
            json.dump(content, f)


    def parse_page(self, req):
        """All the amo API requests have the same Json schema."""
        return json.loads(req.text)


    def get_page(self, url, counter):
        req = self.session.get(url)
        page = self.parse_page(req)
        try:
            content = page['_embedded'][f'{self.basename}']
        except KeyError:
            logger.critical(page)
        self.write(counter, content)
        try:
            next_page = page['_links']['next']['href']
            return next_page
        except KeyError:
            return None


    def _all(self):
        counter = 1
        next_page = self.get_page(self.url, counter)
        while next_page is not None:
            counter += 1
            next_page = self.get_page(next_page, counter)

#+end_src

** Test

#+begin_src jupyter-python :session localhost :kernel python3
from extract import Extract
from amo.entities import Users
from setup import amo20

entity = Users('yastaff')
extract = Extract(amo20, entity, truename="users")

extract._all()
#+end_src

#+RESULTS:


All's working!

* Transform
We've managed to get our entities from AmoCRM with API calls, but Amo data format is Json.
We need tabular format though to send it to the data base.
We'll use some classes to define fields for each entity and write it to *csv*, one file per each entity.
We do that because some of the data is to big to keep it as one file, and reading such file will cause *stack overflow*.
There is another reason for that as well: custom fields for some entities. Those custom fields can be different for each entity, and we need to deal with that, in *Load* phase we'll be updating our schema if new field appears.

