ETL.html

<div id="outline-container-orge6d30aa" class="outline-4">
<h4 id="orge6d30aa"><span class="section-number-4">2.2.4.</span> Pipelines</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Pipelines are sub-entity for <a href="#orge9555be">2.2.1</a>  and contain status names in themselves
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Pipelines</span>(Leads):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"pipelines"</span>
    <span style="color: #7fbbb3;">basename</span> = <span style="color: #a7c080;">"pipelines"</span>
    <span style="color: #7fbbb3;">sub_entity</span> = <span style="color: #a7c080;">"/pipelines"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity\
            + <span style="color: #e67e80;">self</span>.sub_entity + <span style="color: #a7c080;">"?"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge910acc" class="outline-4">
<h4 id="orge910acc"><span class="section-number-4">2.2.5.</span> Users</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Users are stand-alone entity.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Users</span>(Base):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"users"</span>
    <span style="color: #7fbbb3;">entity</span> = <span style="color: #a7c080;">"users"</span>
    <span style="color: #7fbbb3;">basename</span> = <span style="color: #a7c080;">"users"</span>
    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, subdomain):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">url</span> = f<span style="color: #a7c080;">"https://</span>{subdomain}<span style="color: #a7c080;">.amocrm.ru/api/v4/"</span> + <span style="color: #e67e80;">self</span>.entity + <span style="color: #a7c080;">"?"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4bfea47" class="outline-3">
<h3 id="org4bfea47"><span class="section-number-3">2.3.</span> Extraction</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Now, when we have all entities described as API methods, we can start extracting them.
For that we&rsquo;ll create some more classes.
Basically our the only method we need is just extract all the entities from Amo, with filters applied.
Because we defined filters as a base method in previous chapter, we can now just go ahead and define extraction method.
</p>

<p>
Firstly, of course we need to log in, so this will be an attribute of our base class.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> requests
<span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> requests.adapters <span style="color: #e67e80;">import</span> HTTPAdapter
<span style="color: #e67e80;">from</span> amo.logon <span style="color: #e67e80;">import</span> Tokens
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger


<span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Extract</span>:
    session = requests.Session()

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, tokens, entity):
        <span style="color: #7fbbb3;">access_token</span> = tokens.provide_access()
        <span style="color: #7fbbb3;">header</span> = {<span style="color: #a7c080;">"Authorization"</span>: <span style="color: #a7c080;">"Bearer "</span> + access_token}
        <span style="color: #e67e80;">self</span>.session.headers.update(header)
        <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">And to prevent amo from dropping connection:</span>
        <span style="color: #e67e80;">self</span>.session.mount(<span style="color: #a7c080;">'https://'</span>, HTTPAdapter(max_retries=<span style="color: #d699b6;">5</span>))
        <span style="color: #e67e80;">self</span>.basename = entity.basename
        <span style="color: #e67e80;">self</span>.truename = entity.truename        <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">name for writing and further pr...</span>
        <span style="color: #e67e80;">self</span>.amo = tokens.subdomain
        <span style="color: #e67e80;">self</span>.url = entity.url


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">write</span>(<span style="color: #e67e80;">self</span>, counter, content):
        <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(f<span style="color: #a7c080;">'temp_data/</span>{<span style="color: #e67e80;">self</span>.amo}<span style="color: #a7c080;">/</span>{<span style="color: #e67e80;">self</span>.truename}<span style="color: #a7c080;">/</span>{counter}<span style="color: #a7c080;">.json'</span>, <span style="color: #a7c080;">'w'</span>,
                  encoding=<span style="color: #a7c080;">'utf-8'</span>) <span style="color: #e67e80;">as</span> f:
            json.dump(content, f)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">parse_page</span>(<span style="color: #e67e80;">self</span>, req):
        <span style="color: #a7c080;">"""All the amo API requests have the same Json schema."""</span>
        <span style="color: #e67e80;">return</span> json.loads(req.text)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">get_page</span>(<span style="color: #e67e80;">self</span>, url, counter):
        req = <span style="color: #e67e80;">self</span>.session.get(url)
        page = <span style="color: #e67e80;">self</span>.parse_page(req)
        <span style="color: #e67e80;">try</span>:
            content = page[<span style="color: #a7c080;">'_embedded'</span>][f<span style="color: #a7c080;">'</span>{<span style="color: #e67e80;">self</span>.basename}<span style="color: #a7c080;">'</span>]
        <span style="color: #e67e80;">except</span> <span style="color: #a7c080;">KeyError</span>:
            logger.critical(page)
        <span style="color: #e67e80;">self</span>.write(counter, content)
        <span style="color: #e67e80;">try</span>:
            next_page = page[<span style="color: #a7c080;">'_links'</span>][<span style="color: #a7c080;">'next'</span>][<span style="color: #a7c080;">'href'</span>]
            <span style="color: #e67e80;">return</span> next_page
        <span style="color: #e67e80;">except</span> <span style="color: #a7c080;">KeyError</span>:
            <span style="color: #e67e80;">return</span> <span style="color: #83c092;">None</span>


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">_all</span>(<span style="color: #e67e80;">self</span>):
        counter = <span style="color: #d699b6;">1</span>
        next_page = <span style="color: #e67e80;">self</span>.get_page(<span style="color: #e67e80;">self</span>.url, counter)
        <span style="color: #e67e80;">while</span> next_page <span style="color: #e67e80;">is</span> <span style="color: #e67e80;">not</span> <span style="color: #83c092;">None</span>:
            counter += <span style="color: #d699b6;">1</span>
            next_page = <span style="color: #e67e80;">self</span>.get_page(next_page, counter)
        logger.success(f<span style="color: #a7c080;">"</span>{counter}<span style="color: #a7c080;"> pages downloaded!"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-orge5cecbf" class="outline-3">
<h3 id="orge5cecbf"><span class="section-number-3">2.4.</span> Test</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Users
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20

<span style="color: #7fbbb3;">entity</span> = Users(<span style="color: #a7c080;">'yastaff'</span>)
<span style="color: #7fbbb3;">extract</span> = Extract(amo20, entity, truename=<span style="color: #a7c080;">"users"</span>)

extract._all()
</pre>
</div>


<p>
All&rsquo;s working!
</p>
</div>
</div>
</div>

<div id="outline-container-org5bcc882" class="outline-2">
<h2 id="org5bcc882"><span class="section-number-2">3.</span> Transform</h2>
<div class="outline-text-2" id="text-3">
<p>
We&rsquo;ve managed to get our entities from AmoCRM with API calls, but Amo data format is Json.
We need tabular format though to send it to the data base.
We&rsquo;ll use some classes to define fields for each entity and write it to <b>csv</b>, one file per each entity.
We do that because some of the data is to big to keep it as one file, and reading such file will cause <b>stack overflow</b>.
There is another reason for that as well: custom fields for some entities. Those custom fields can be different for each entity, and we need to deal with that, in <b>Load</b> phase we&rsquo;ll be updating our schema if new field appears.
</p>
</div>
