ETL.org
** Transform Statuses
As we remember Statuses are sub-type of the events, so we'll first define Events class, and inherit from it.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle transform.py
class Tevents(Base):
    truename = "events"

    def __init__(self, dict_):
        self.id_ = dict_["id"]
        self.type_ = dict_["type"]
        self.entity_id = dict_["entity_id"]
        self.entity_type = dict_["entity_type"]
        self.created_by = dict_["created_by"]
        self.created_at = dict_["created_at"]
        self.account_id = dict_["account_id"]


class Tstatuses(Tevents):
    truename = "statuses"

    def __init__(self, dict_):
        self.id_ = dict_["id"]
        self.type_ = dict_["type"]
        self.entity_id = dict_["entity_id"]
        self.entity_type = dict_["entity_type"]
        self.created_by = dict_["created_by"]
        self.created_at = dict_["created_at"]
        self.account_id = dict_["account_id"]
        self.value_after_status_id = dict_["value_after"][0]["lead_status"]["id"]
        self.value_after_pipeline_id = dict_["value_after"][0]["lead_status"]["pipeline_id"]
        self.value_before_status_id = dict_["value_before"][0]["lead_status"]["id"]
        self.value_before_pipeline_id = dict_["value_before"][0]["lead_status"]["pipeline_id"]

#+end_src

** Transform Calls
#+begin_src jupyter-python :session localhost :kernel python3 :tangle transform.py
class Tcalls(Base):
    truename = "calls"

    def __init__(self, dict_):
        self.id_ = dict_["id"]
        self.entity_id = dict_["entity_id"]
        self.created_by = dict_["created_by"]
        self.updated_by = dict_["updated_by"]
        self.created_at = dict_["created_at"]
        self.updated_at = dict_["updated_at"]
        self.responsible_user_id = dict_["responsible_user_id"]
        self.group_id = dict_["group_id"]
        self.uniq = dict_["params"]["uniq"]
        # self.account_id = dict_["params"]["account_id"]
        self.duration = dict_["params"]["duration"]
        self.source = dict_["params"]["source"]
        self.phone = dict_["params"]["phone"]

#+end_src
** Tranform Pipelines
Pipelines are a bit tricky as well.
Though there are no custom fields different for each entry, it contains statuses inside each pipeline.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle transform.py
class Tpipelines(Base):
    truename = "pipelines"

    def __init__(self, dict_):
        self.pipeline_id = dict_["id"]
        self.pipeline_name = dict_["name"]
        self.is_archive = dict_["is_archive"]
        self.statuses = dict_["_embedded"]["statuses"]

    def write_statuses(self, path):
        for status in self.statuses:
            self.id_ = status["id"]
            content = {
                "id_": status["id"],
                "pipeline_id": self.pipeline_id,
                "pipeline_name": self.pipeline_name,
                "pipeline_is_acrhive": self.is_archive,
                "name": status["name"],
                "sort": status["sort"]
            }
            with open(
                    f"{path}/{content['id_']}.csv",
                    'w', encoding="utf-8") as f:
                writer = csv.writer(f)
                writer.writerow(content.keys())
                writer.writerow(content.values())
#+end_src

