ETL.html

<div id="outline-container-org9f7a948" class="outline-3">
<h3 id="org9f7a948"><span class="section-number-3">3.4.</span> Transform Statuses</h3>
<div class="outline-text-3" id="text-3-4">
<p>
As we remember Statuses are sub-type of the events, so we&rsquo;ll first define Events class, and inherit from it.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Tevents</span>(Base):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"events"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, dict_):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">id_</span> = dict_[<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">type_</span> = dict_[<span style="color: #a7c080;">"type"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity_id</span> = dict_[<span style="color: #a7c080;">"entity_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity_type</span> = dict_[<span style="color: #a7c080;">"entity_type"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_by</span> = dict_[<span style="color: #a7c080;">"created_by"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_at</span> = dict_[<span style="color: #a7c080;">"created_at"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">account_id</span> = dict_[<span style="color: #a7c080;">"account_id"</span>]


<span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Tstatuses</span>(Tevents):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"statuses"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, dict_):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">id_</span> = dict_[<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">type_</span> = dict_[<span style="color: #a7c080;">"type"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity_id</span> = dict_[<span style="color: #a7c080;">"entity_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity_type</span> = dict_[<span style="color: #a7c080;">"entity_type"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_by</span> = dict_[<span style="color: #a7c080;">"created_by"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_at</span> = dict_[<span style="color: #a7c080;">"created_at"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">account_id</span> = dict_[<span style="color: #a7c080;">"account_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">value_after_status_id</span> = dict_[<span style="color: #a7c080;">"value_after"</span>][<span style="color: #d699b6;">0</span>][<span style="color: #a7c080;">"lead_status"</span>][<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">value_after_pipeline_id</span> = dict_[<span style="color: #a7c080;">"value_after"</span>][<span style="color: #d699b6;">0</span>][<span style="color: #a7c080;">"lead_status"</span>][<span style="color: #a7c080;">"pipeline_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">value_before_status_id</span> = dict_[<span style="color: #a7c080;">"value_before"</span>][<span style="color: #d699b6;">0</span>][<span style="color: #a7c080;">"lead_status"</span>][<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">value_before_pipeline_id</span> = dict_[<span style="color: #a7c080;">"value_before"</span>][<span style="color: #d699b6;">0</span>][<span style="color: #a7c080;">"lead_status"</span>][<span style="color: #a7c080;">"pipeline_id"</span>]

</pre>
</div>
</div>
</div>

<div id="outline-container-org532120c" class="outline-3">
<h3 id="org532120c"><span class="section-number-3">3.5.</span> Transform Calls</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Tcalls</span>(Base):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"calls"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, dict_):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">id_</span> = dict_[<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity_id</span> = dict_[<span style="color: #a7c080;">"entity_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_by</span> = dict_[<span style="color: #a7c080;">"created_by"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">updated_by</span> = dict_[<span style="color: #a7c080;">"updated_by"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">created_at</span> = dict_[<span style="color: #a7c080;">"created_at"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">updated_at</span> = dict_[<span style="color: #a7c080;">"updated_at"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">responsible_user_id</span> = dict_[<span style="color: #a7c080;">"responsible_user_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">group_id</span> = dict_[<span style="color: #a7c080;">"group_id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">uniq</span> = dict_[<span style="color: #a7c080;">"params"</span>][<span style="color: #a7c080;">"uniq"</span>]
        <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">self.account_id = dict_["params"]["account_id"]</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">duration</span> = dict_[<span style="color: #a7c080;">"params"</span>][<span style="color: #a7c080;">"duration"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">source</span> = dict_[<span style="color: #a7c080;">"params"</span>][<span style="color: #a7c080;">"source"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">phone</span> = dict_[<span style="color: #a7c080;">"params"</span>][<span style="color: #a7c080;">"phone"</span>]

</pre>
</div>
</div>
</div>
<div id="outline-container-orga79f910" class="outline-3">
<h3 id="orga79f910"><span class="section-number-3">3.6.</span> Tranform Pipelines</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Pipelines are a bit tricky as well.
Though there are no custom fields different for each entry, it contains statuses inside each pipeline.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Tpipelines</span>(Base):
    <span style="color: #7fbbb3;">truename</span> = <span style="color: #a7c080;">"pipelines"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, dict_):
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">pipeline_id</span> = dict_[<span style="color: #a7c080;">"id"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">pipeline_name</span> = dict_[<span style="color: #a7c080;">"name"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">is_archive</span> = dict_[<span style="color: #a7c080;">"is_archive"</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">statuses</span> = dict_[<span style="color: #a7c080;">"_embedded"</span>][<span style="color: #a7c080;">"statuses"</span>]

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">write_statuses</span>(<span style="color: #e67e80;">self</span>, path):
        <span style="color: #e67e80;">for</span> status <span style="color: #e67e80;">in</span> <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">statuses</span>:
            <span style="color: #e67e80;">self</span>.id_ = status[<span style="color: #a7c080;">"id"</span>]
            <span style="color: #7fbbb3;">content</span> = {
                <span style="color: #a7c080;">"id_"</span>: status[<span style="color: #a7c080;">"id"</span>],
                <span style="color: #a7c080;">"pipeline_id"</span>: <span style="color: #e67e80;">self</span>.pipeline_id,
                <span style="color: #a7c080;">"pipeline_name"</span>: <span style="color: #e67e80;">self</span>.pipeline_name,
                <span style="color: #a7c080;">"pipeline_is_acrhive"</span>: <span style="color: #e67e80;">self</span>.is_archive,
                <span style="color: #a7c080;">"name"</span>: status[<span style="color: #a7c080;">"name"</span>],
                <span style="color: #a7c080;">"sort"</span>: status[<span style="color: #a7c080;">"sort"</span>]
            }
            <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(
                    f<span style="color: #a7c080;">"</span>{path}<span style="color: #a7c080;">/</span>{content['id_']}<span style="color: #a7c080;">.csv"</span>,
                    <span style="color: #a7c080;">'w'</span>, encoding=<span style="color: #a7c080;">"utf-8"</span>) <span style="color: #e67e80;">as</span> f:
                writer = csv.writer(f)
                writer.writerow(content.keys())
                writer.writerow(content.values())
</pre>
</div>
</div>
</div>
