ETL.org
** Transform all
Now when we have classes for all the entities, we want a clear procedure of transforming them all at once.
We have a directory with multiple Json files, each of them contains list of dictionaries.
We want to read them all, and, if succeeded, clear the directory.

#+begin_src jupyter-python :session localhost :kernel python3 :tangle transform.py
class Transform:
    def __init__(self, amo, entity):
       self.amo = amo
       self.entity = entity
       self.name = entity.truename
       self.input_path = f"temp_data/{amo}/{self.name}/"
       self.output_path = f"temp_data/{self.amo}/{self.name}_transformed/"

    def transform_file(self, json_file):
        for entry in json_file:
            entity = self.entity(entry)
            entity.write(self.output_path)


    def cleanup(self):
        for p in Path(self.input_path).iterdir():
            rm(p)


    def _all(self):
        for p in Path(self.input_path).iterdir():
            with open(p, "r") as f:
                j = json.load(f)
                self.transform_file(j)
        return True


#+end_src

And since statuses have different write methods, we should inherit the other class for them:

#+begin_src jupyter-python :session localhost :kernel python3 :tangle transform.py
class TransformPipelines(Transform):

    def __init__(self, amo, entity):
       self.amo = amo
       self.entity = entity
       self.name = entity.truename
       self.input_path = f"temp_data/{amo}/{self.name}/"
       self.output_path = f"temp_data/{self.amo}/{self.name}_transformed/"

    def transform_file(self, json_file):
        for entry in json_file:
            entity = self.entity(entry)
            entity.write_statuses(self.output_path)

#+end_src

