ETL.html

<div id="outline-container-orgc4beb5a" class="outline-3">
<h3 id="orgc4beb5a"><span class="section-number-3">3.7.</span> Transform all</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Now when we have classes for all the entities, we want a clear procedure of transforming them all at once.
We have a directory with multiple Json files, each of them contains list of dictionaries.
We want to read them all, and, if succeeded, clear the directory.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Transform</span>:
    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, amo, entity):
       <span style="color: #e67e80;">self</span>.amo = amo
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity</span> = entity
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">name</span> = entity.truename
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">input_path</span> = f<span style="color: #a7c080;">"temp_data/</span>{amo}<span style="color: #a7c080;">/</span>{<span style="color: #e67e80;">self</span>.name}<span style="color: #a7c080;">/"</span>
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">output_path</span> = f<span style="color: #a7c080;">"temp_data/</span>{<span style="color: #e67e80;">self</span>.amo}<span style="color: #a7c080;">/</span>{<span style="color: #e67e80;">self</span>.name}<span style="color: #a7c080;">_transformed/"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">transform_file</span>(<span style="color: #e67e80;">self</span>, json_file):
        <span style="color: #e67e80;">for</span> entry <span style="color: #e67e80;">in</span> <span style="color: #7fbbb3;">json_file</span>:
            entity = <span style="color: #e67e80;">self</span>.entity(entry)
            entity.write(<span style="color: #e67e80;">self</span>.output_path)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">cleanup</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">for</span> p <span style="color: #e67e80;">in</span> Path(<span style="color: #e67e80;">self</span>.input_path).iterdir():
            rm(p)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">_all</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">for</span> p <span style="color: #e67e80;">in</span> Path(<span style="color: #e67e80;">self</span>.input_path).iterdir():
            <span style="color: #e67e80;">with</span> <span style="color: #83c092;">open</span>(p, <span style="color: #a7c080;">"r"</span>) <span style="color: #e67e80;">as</span> <span style="color: #7fbbb3;">f</span>:
                j = json.load(f)
                <span style="color: #e67e80;">self</span>.transform_file(j)
        logger.success(<span style="color: #a7c080;">"Transform successful!"</span>)
        <span style="color: #e67e80;">return</span> <span style="color: #83c092;">True</span>


</pre>
</div>

<p>
And since statuses have different write methods, we should inherit the other class for them:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">TransformPipelines</span>(Transform):

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, amo, entity):
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">amo</span> = amo
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">entity</span> = entity
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">name</span> = entity.truename
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">input_path</span> = f<span style="color: #a7c080;">"temp_data/</span>{amo}<span style="color: #a7c080;">/</span>{<span style="color: #e67e80;">self</span>.name}<span style="color: #a7c080;">/"</span>
       <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">output_path</span> = f<span style="color: #a7c080;">"temp_data/</span>{<span style="color: #e67e80;">self</span>.amo}<span style="color: #a7c080;">/</span>{<span style="color: #e67e80;">self</span>.name}<span style="color: #a7c080;">_transformed/"</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">transform_file</span>(<span style="color: #e67e80;">self</span>, json_file):
        <span style="color: #e67e80;">for</span> entry <span style="color: #e67e80;">in</span> <span style="color: #7fbbb3;">json_file</span>:
            entity = <span style="color: #e67e80;">self</span>.entity(entry)
            entity.write_statuses(<span style="color: #e67e80;">self</span>.output_path)

</pre>
</div>
</div>
</div>
</div>
