ETL.html

<div id="outline-container-orgfeabf0e" class="outline-2">
<h2 id="orgfeabf0e"><span class="section-number-2">4.</span> Load</h2>
<div class="outline-text-2" id="text-4">
<p>
We&rsquo;re using Google BigQuery as Data Warehouse, so we need first to establish a connection with the help of credentials file.
</p>

<p>
First, we create base load class for all the entities:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> os
<span style="color: #e67e80;">from</span> datetime <span style="color: #e67e80;">import</span> datetime
<span style="color: #e67e80;">import</span> pandas <span style="color: #e67e80;">as</span> pd
<span style="color: #e67e80;">from</span> google.cloud <span style="color: #e67e80;">import</span> bigquery <span style="color: #e67e80;">as</span> bq
<span style="color: #e67e80;">from</span> google.api_core.exceptions <span style="color: #e67e80;">import</span> BadRequest
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger


<span style="color: #e67e80;">class</span> <span style="color: #a7c080;">Load</span>:
    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, amo, entity):
        os.environ[<span style="color: #a7c080;">"GOOGLE_APPLICATION_CREDENTIALS"</span>] = \
            <span style="color: #a7c080;">'./tokens/oddjob-db-2007-759fe782b144.json'</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">client</span> = bq.Client()
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">path</span> = f<span style="color: #a7c080;">"temp_data/</span>{amo}<span style="color: #a7c080;">/</span>{entity}<span style="color: #a7c080;">_transformed/"</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">date</span> = <span style="color: #83c092;">str</span>(datetime.now()).replace(<span style="color: #a7c080;">" "</span>, <span style="color: #a7c080;">"-"</span>)\
                                       .replace(<span style="color: #a7c080;">":"</span>, <span style="color: #a7c080;">"-"</span>)\
                                       .split(<span style="color: #a7c080;">"."</span>)[<span style="color: #d699b6;">0</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">files_num</span> = <span style="color: #83c092;">sum</span>(<span style="color: #d699b6;">1</span> <span style="color: #e67e80;">for</span> <span style="color: #83c092;">file</span> <span style="color: #e67e80;">in</span> os.listdir(<span style="color: #e67e80;">self</span>.path))
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">file_list</span> = [<span style="color: #e67e80;">self</span>.path + f <span style="color: #e67e80;">for</span> f <span style="color: #e67e80;">in</span> os.listdir(<span style="color: #e67e80;">self</span>.path)]

        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">table_ref</span> = <span style="color: #e67e80;">self</span>.client.dataset(
                f<span style="color: #a7c080;">"</span>{amo}<span style="color: #a7c080;">_oddjob"</span>).table(f<span style="color: #a7c080;">"dw_amocrm_</span>{entity}<span style="color: #a7c080;">"</span>)

        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">table_backup</span> = <span style="color: #e67e80;">self</span>.client.dataset(
            f<span style="color: #a7c080;">"</span>{amo}<span style="color: #a7c080;">_oddjob"</span>).table(f<span style="color: #a7c080;">"dw_amocrm_</span>{entity}<span style="color: #a7c080;">_</span>{<span style="color: #e67e80;">self</span>.date}<span style="color: #a7c080;">"</span>)
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">job_config</span> = bq.LoadJobConfig(autodetect=<span style="color: #83c092;">True</span>)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">backup</span>(<span style="color: #e67e80;">self</span>):
        job = <span style="color: #e67e80;">self</span>.client.copy_table(
            <span style="color: #e67e80;">self</span>.table_ref, <span style="color: #e67e80;">self</span>.table_backup
        )
        logger.success(<span style="color: #a7c080;">"Table successfully backed up!"</span>)
        <span style="color: #e67e80;">self</span>.client.delete_table(<span style="color: #e67e80;">self</span>.table_ref)
        <span style="color: #e67e80;">self</span>.client.create_table(<span style="color: #e67e80;">self</span>.table_ref)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">read</span>(<span style="color: #e67e80;">self</span>, filepath):
        <span style="color: #e67e80;">return</span> pd.read_csv(filepath)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">load</span>(<span style="color: #e67e80;">self</span>, df):
        job = <span style="color: #e67e80;">self</span>.client.load_table_from_dataframe(
            df, <span style="color: #e67e80;">self</span>.table_ref, job_config=<span style="color: #e67e80;">self</span>.job_config
        )
        logger.success(job.result())


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">in_batches</span>(<span style="color: #e67e80;">self</span>, batch_size=<span style="color: #d699b6;">10000</span>):
        logger.info(f<span style="color: #a7c080;">"There are </span>{<span style="color: #e67e80;">self</span>.files_num}<span style="color: #a7c080;"> files to send..."</span>)
        <span style="color: #e67e80;">for</span> i <span style="color: #e67e80;">in</span> <span style="color: #83c092;">range</span>(<span style="color: #d699b6;">0</span>, <span style="color: #e67e80;">self</span>.files_num, batch_size):
            batch_files = <span style="color: #e67e80;">self</span>.file_list[i:i+batch_size]
            df_list = [<span style="color: #e67e80;">self</span>.read(f) <span style="color: #e67e80;">for</span> f <span style="color: #e67e80;">in</span> batch_files]
            df = pd.concat(df_list).astype(<span style="color: #a7c080;">'str'</span>)
            <span style="color: #e67e80;">self</span>.load(df)
        logger.success(<span style="color: #a7c080;">"Load successful!"</span>)
        <span style="color: #e67e80;">return</span> <span style="color: #83c092;">True</span>

    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">cleanup</span>(<span style="color: #e67e80;">self</span>):
        <span style="color: #e67e80;">for</span> f <span style="color: #e67e80;">in</span> <span style="color: #e67e80;">self</span>.file_list:
            os.remove(f)


</pre>
</div>

<p>
For leads we need something more advanced, because there are custom fields which are different for each entity.
So, we&rsquo;ll need to update table schema in case there are some column that is not present.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">class</span> <span style="color: #a7c080;">LoadWithSchemaUpdate</span>(Load):
    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">__init__</span>(<span style="color: #e67e80;">self</span>, amo, entity):
        os.<span style="color: #7fbbb3;">environ</span>[<span style="color: #a7c080;">"GOOGLE_APPLICATION_CREDENTIALS"</span>] = \
            <span style="color: #a7c080;">'./tokens/oddjob-db-2007-759fe782b144.json'</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">client</span> = bq.Client()
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">path</span> = f<span style="color: #a7c080;">"temp_data/</span>{amo}<span style="color: #a7c080;">/</span>{entity}<span style="color: #a7c080;">_transformed/"</span>
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">date</span> = <span style="color: #83c092;">str</span>(datetime.now()).replace(<span style="color: #a7c080;">" "</span>, <span style="color: #a7c080;">"-"</span>)\
                                       .replace(<span style="color: #a7c080;">":"</span>, <span style="color: #a7c080;">"-"</span>)\
                                       .split(<span style="color: #a7c080;">"."</span>)[<span style="color: #d699b6;">0</span>]
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">files_num</span> = <span style="color: #83c092;">sum</span>(<span style="color: #d699b6;">1</span> <span style="color: #e67e80;">for</span> <span style="color: #83c092;">file</span> <span style="color: #e67e80;">in</span> os.listdir(<span style="color: #e67e80;">self</span>.path))
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">file_list</span> = [<span style="color: #e67e80;">self</span>.path + f <span style="color: #e67e80;">for</span> f <span style="color: #e67e80;">in</span> os.listdir(<span style="color: #e67e80;">self</span>.path)]

        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">table_ref</span> = <span style="color: #e67e80;">self</span>.client.dataset(
                f<span style="color: #a7c080;">"</span>{amo}<span style="color: #a7c080;">_oddjob"</span>).table(f<span style="color: #a7c080;">"dw_amocrm_</span>{entity}<span style="color: #a7c080;">"</span>)

        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">table_backup</span> = <span style="color: #e67e80;">self</span>.client.dataset(
            f<span style="color: #a7c080;">"</span>{amo}<span style="color: #a7c080;">_oddjob"</span>).table(f<span style="color: #a7c080;">"dw_amocrm_</span>{entity}<span style="color: #a7c080;">_</span>{<span style="color: #e67e80;">self</span>.date}<span style="color: #a7c080;">"</span>)
        <span style="color: #e67e80;">self</span>.<span style="color: #7fbbb3;">job_config</span> = bq.LoadJobConfig(autodetect=<span style="color: #83c092;">True</span>)


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">get_schema_from_dataframe</span>(<span style="color: #e67e80;">self</span>, df, old_schema):

        df[df.select_dtypes(include=[<span style="color: #a7c080;">'object'</span>]).columns] =\
            df.select_dtypes(include=[<span style="color: #a7c080;">'object'</span>]).astype(<span style="color: #a7c080;">'string'</span>)
        old_schema_names = [field.name <span style="color: #e67e80;">for</span> field <span style="color: #e67e80;">in</span> old_schema]
        schema = []

        <span style="color: #e67e80;">for</span> col_name, dtype <span style="color: #e67e80;">in</span> df.dtypes.items():
            <span style="color: #e67e80;">if</span> col_name <span style="color: #e67e80;">not</span> <span style="color: #e67e80;">in</span> old_schema_names:
                schema.append(bq.SchemaField(col_name, dtype.name))
        <span style="color: #e67e80;">return</span> schema


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">update_schema</span>(<span style="color: #e67e80;">self</span>, df):
        table = <span style="color: #e67e80;">self</span>.client.get_table(<span style="color: #e67e80;">self</span>.table_ref)

        old_schema = <span style="color: #83c092;">list</span>(table.schema)
        new_schema = <span style="color: #e67e80;">self</span>.get_schema_from_dataframe(df, old_schema)

        combined_schema = old_schema + new_schema

        table.schema = combined_schema
        <span style="color: #e67e80;">self</span>.client.update_table(table, [<span style="color: #a7c080;">"schema"</span>])


    <span style="color: #e67e80;">def</span> <span style="color: #a7c080;">in_batches</span>(<span style="color: #e67e80;">self</span>, batch_size=<span style="color: #d699b6;">10000</span>):
        <span style="color: #e67e80;">for</span> i <span style="color: #e67e80;">in</span> <span style="color: #83c092;">range</span>(<span style="color: #d699b6;">0</span>, <span style="color: #e67e80;">self</span>.files_num, batch_size):
            batch_files = <span style="color: #e67e80;">self</span>.file_list[i:i+batch_size]
            df_list = [<span style="color: #e67e80;">self</span>.read(f) <span style="color: #e67e80;">for</span> f <span style="color: #e67e80;">in</span> batch_files]
            df = pd.concat(df_list).astype(<span style="color: #a7c080;">'str'</span>)
            <span style="color: #e67e80;">try</span>:
                <span style="color: #e67e80;">self</span>.load(df)

            <span style="color: #e67e80;">except</span> BadRequest <span style="color: #e67e80;">as</span> e:
                logger.info(e)
                <span style="color: #e67e80;">self</span>.update_schema(df)
                <span style="color: #e67e80;">self</span>.load(df)
        <span style="color: #e67e80;">return</span> <span style="color: #83c092;">True</span>


</pre>
</div>
</div>
</div>
