ETL.org
* ETL's themselves
Finally we have everything ready, so we can write our ETL's script which will combine all we defined in previous steps and make it work (hopefully).
** Leads ETL
*** Yastaff

#+begin_src jupyter-python :session localhost :kernel amo20 :tangle yastaff_etl_leads.py
import json
from extract import Extract
from amo.entities import Leads
from setup import amo20
from transform import Tleads, Transform
from load import LoadWithSchemaUpdate

AMO = 'yastaff'
ENTITY = Tleads

method = Leads('yastaff').created_at(from_="2022-12-01") #TODO
extract = Extract(amo20, method)

transform = Transform(AMO, ENTITY)

load = LoadWithSchemaUpdate(AMO, ENTITY.truename)

if __name__ == "__main__":
    extract._all()

    if transform._all():
        transform.cleanup()

    load.backup()
    if load.in_batches():
        load.cleanup()
#+end_src

** Calls ETL
*** Yastaff

#+begin_src jupyter-python :session localhost :kernel python3 :tangle yastaff_etl_calls.py
import json
from extract import Extract
from amo.entities import Calls
from setup import amo20
from transform import Tcalls, Transform
from load import Load

AMO = 'yastaff'
ENTITY = Tcalls

method = Calls('yastaff').created_at(from_="2021-12-01")
extract = Extract(amo20, method)

transform = Transform(AMO, ENTITY)

load = Load(AMO, ENTITY.truename)

if __name__ == "__main__":
    extract._all()

    if transform._all():
        transform.cleanup()

    load.backup()
    if load.in_batches():
        load.cleanup()
#+end_src

** Statuses ETL
*** Yastaff

#+begin_src jupyter-python :session localhost :kernel python3 :tangle yastaff_etl_statuses.py
import json
from extract import Extract
from amo.entities import Statuses
from setup import amo20
from transform import Tstatuses, Transform
from load import Load

AMO = 'yastaff'
ENTITY = Tstatuses

method = Statuses('yastaff').created_at(from_="2021-12-15")
extract = Extract(amo20, method)

transform = Transform(AMO, ENTITY)

load = Load(AMO, ENTITY.truename)

if __name__ == "__main__":
    extract._all()

    if transform._all():
        transform.cleanup()

    load.backup()
    if load.in_batches():
        load.cleanup()
#+end_src

** Users ETL
*** Yastaff

#+begin_src jupyter-python :session localhost :kernel amo20 :tangle yastaff_etl_users.py
import json
from extract import Extract
from amo.entities import Users
from setup import amo20
from transform import Tusers, Transform
from load import Load

AMO = 'yastaff'
ENTITY = Tusers

method = Users('yastaff')  # .created_at(from_=)
extract = Extract(amo20, method)

transform = Transform(AMO, ENTITY)

load = Load(AMO, ENTITY.truename)

if __name__ == "__main__":
    extract._all()

    if transform._all():
        transform.cleanup()

    load.backup()
    if load.in_batches():
        load.cleanup()
#+end_src

** Pipelines ETL
*** Yastaff

#+begin_src jupyter-python :session localhost :kernel python3 :tangle yastaff_etl_pipelines.py
import json
from extract import Extract
from amo.entities import Pipelines
from setup import amo20
from transform import Tpipelines, TransformPipelines
from load import Load

AMO = 'yastaff'
ENTITY = Tpipelines

method = Pipelines('yastaff')  # .created_at(from_=)
extract = Extract(amo20, method)

transform = TransformPipelines(AMO, ENTITY)

load = Load(AMO, ENTITY.truename)

if __name__ == "__main__":
    extract._all()

    if transform._all():
        transform.cleanup()

    load.backup()
    if load.in_batches():
        load.cleanup()
#+end_src

* Shell to rule them all
Now, when we have defined ETL's for all the entities, it is time to automate the process.
Two most common tools for that are cron jobs and Airflow.
Airflow is good when you have the full orchestra of pipelines, but since we only have few processes, we'll use cron.
For that we'll create a simple script, which then we'll pass to crontab.
