ETL.html

<div id="outline-container-org118a7df" class="outline-2">
<h2 id="org118a7df"><span class="section-number-2">5.</span> ETL&rsquo;s themselves</h2>
<div class="outline-text-2" id="text-5">
<p>
Finally we have everything ready, so we can write our ETL&rsquo;s script which will combine all we defined in previous steps and make it work (hopefully).
</p>
</div>
<div id="outline-container-org4cb5149" class="outline-3">
<h3 id="org4cb5149"><span class="section-number-3">5.1.</span> Leads ETL</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org1b0aff1" class="outline-4">
<h4 id="org1b0aff1"><span class="section-number-4">5.1.1.</span> Yastaff</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Leads
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> transform <span style="color: #e67e80;">import</span> Tleads, Transform
<span style="color: #e67e80;">from</span> load <span style="color: #e67e80;">import</span> LoadWithSchemaUpdate
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger

<span style="color: #7fbbb3;">AMO</span> = <span style="color: #a7c080;">'yastaff'</span>
<span style="color: #7fbbb3;">ENTITY</span> = Tleads

<span style="color: #7fbbb3;">method</span> = Leads(<span style="color: #a7c080;">'yastaff'</span>)<span style="color: #859289; font-style: italic;">#</span><span style="color: #859289; font-style: italic;">.created_at(from_="2022-12-15") #</span><span style="color: #ddbc7f; font-weight: bold; font-style: italic;">TODO</span>

<span style="color: #e67e80;">if</span> <span style="color: #83c092;">__name__</span> == <span style="color: #a7c080;">"__main__"</span>:
    logger.info(f<span style="color: #a7c080;">"starting etl: </span>{ENTITY.truename}<span style="color: #a7c080;">"</span>)
    extract = Extract(amo20, method)
    extract._all()

    transform = Transform(AMO, ENTITY)
    <span style="color: #e67e80;">if</span> transform._all():
        transform.cleanup()

    load = LoadWithSchemaUpdate(AMO, ENTITY.truename)
    load.backup()
    <span style="color: #e67e80;">if</span> load.in_batches():
        load.cleanup()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1a650da" class="outline-3">
<h3 id="org1a650da"><span class="section-number-3">5.2.</span> Calls ETL</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgbb2b15c" class="outline-4">
<h4 id="orgbb2b15c"><span class="section-number-4">5.2.1.</span> Yastaff</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Calls
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> transform <span style="color: #e67e80;">import</span> Tcalls, Transform
<span style="color: #e67e80;">from</span> load <span style="color: #e67e80;">import</span> Load
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger

<span style="color: #7fbbb3;">AMO</span> = <span style="color: #a7c080;">'yastaff'</span>
<span style="color: #7fbbb3;">ENTITY</span> = Tcalls

<span style="color: #7fbbb3;">method</span> = Calls(<span style="color: #a7c080;">'yastaff'</span>)<span style="color: #859289; font-style: italic;">#</span><span style="color: #859289; font-style: italic;">.created_at(from_="2022-12-15")</span>

<span style="color: #e67e80;">if</span> <span style="color: #83c092;">__name__</span> == <span style="color: #a7c080;">"__main__"</span>:
    logger.info(f<span style="color: #a7c080;">"starting etl: </span>{ENTITY.truename}<span style="color: #a7c080;">"</span>)
    extract = Extract(amo20, method)
    extract._all()

    transform = Transform(AMO, ENTITY)
    <span style="color: #e67e80;">if</span> transform._all():
        transform.cleanup()

    load = Load(AMO, ENTITY.truename)
    load.backup()
    <span style="color: #e67e80;">if</span> load.in_batches():
        load.cleanup()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd344f46" class="outline-3">
<h3 id="orgd344f46"><span class="section-number-3">5.3.</span> Statuses ETL</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgb6b2fc7" class="outline-4">
<h4 id="orgb6b2fc7"><span class="section-number-4">5.3.1.</span> Yastaff</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Statuses
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> transform <span style="color: #e67e80;">import</span> Tstatuses, Transform
<span style="color: #e67e80;">from</span> load <span style="color: #e67e80;">import</span> Load
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger

<span style="color: #7fbbb3;">AMO</span> = <span style="color: #a7c080;">'yastaff'</span>
<span style="color: #7fbbb3;">ENTITY</span> = Tstatuses

<span style="color: #7fbbb3;">method</span> = Statuses(<span style="color: #a7c080;">'yastaff'</span>)<span style="color: #859289; font-style: italic;">#</span><span style="color: #859289; font-style: italic;">.created_at(from_="2022-12-15")</span>
<span style="color: #e67e80;">if</span> <span style="color: #83c092;">__name__</span> == <span style="color: #a7c080;">"__main__"</span>:
    logger.info(f<span style="color: #a7c080;">"starting etl: </span>{ENTITY.truename}<span style="color: #a7c080;">"</span>)
    extract = Extract(amo20, method)
    extract._all()

    transform = Transform(AMO, ENTITY)
    <span style="color: #e67e80;">if</span> transform._all():
        transform.cleanup()

    load = Load(AMO, ENTITY.truename)
    load.backup()
    <span style="color: #e67e80;">if</span> load.in_batches():
        load.cleanup()

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8489b23" class="outline-3">
<h3 id="org8489b23"><span class="section-number-3">5.4.</span> Users ETL</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org5424b4d" class="outline-4">
<h4 id="org5424b4d"><span class="section-number-4">5.4.1.</span> Yastaff</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Users
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> transform <span style="color: #e67e80;">import</span> Tusers, Transform
<span style="color: #e67e80;">from</span> load <span style="color: #e67e80;">import</span> Load
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger

<span style="color: #7fbbb3;">AMO</span> = <span style="color: #a7c080;">'yastaff'</span>
<span style="color: #7fbbb3;">ENTITY</span> = Tusers

<span style="color: #7fbbb3;">method</span> = Users(<span style="color: #a7c080;">'yastaff'</span>)  <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">.created_at(from_=)</span>

<span style="color: #e67e80;">if</span> <span style="color: #83c092;">__name__</span> == <span style="color: #a7c080;">"__main__"</span>:
    logger.info(f<span style="color: #a7c080;">"starting etl: </span>{ENTITY.truename}<span style="color: #a7c080;">"</span>)
    extract = Extract(amo20, method)
    extract._all()

    transform = Transform(AMO, ENTITY)
    <span style="color: #e67e80;">if</span> transform._all():
        transform.cleanup()

    load = Load(AMO, ENTITY.truename)
    load.backup()
    <span style="color: #e67e80;">if</span> load.in_batches():
        load.cleanup()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbbea09f" class="outline-3">
<h3 id="orgbbea09f"><span class="section-number-3">5.5.</span> Pipelines ETL</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-org4f8d110" class="outline-4">
<h4 id="org4f8d110"><span class="section-number-4">5.5.1.</span> Yastaff</h4>
<div class="outline-text-4" id="text-5-5-1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #e67e80;">import</span> json
<span style="color: #e67e80;">from</span> extract <span style="color: #e67e80;">import</span> Extract
<span style="color: #e67e80;">from</span> amo.entities <span style="color: #e67e80;">import</span> Pipelines
<span style="color: #e67e80;">from</span> setup <span style="color: #e67e80;">import</span> amo20
<span style="color: #e67e80;">from</span> transform <span style="color: #e67e80;">import</span> Tpipelines, TransformPipelines
<span style="color: #e67e80;">from</span> load <span style="color: #e67e80;">import</span> Load
<span style="color: #e67e80;">from</span> loguru <span style="color: #e67e80;">import</span> logger

<span style="color: #7fbbb3;">AMO</span> = <span style="color: #a7c080;">'yastaff'</span>
<span style="color: #7fbbb3;">ENTITY</span> = Tpipelines

<span style="color: #7fbbb3;">method</span> = Pipelines(<span style="color: #a7c080;">'yastaff'</span>)  <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">.created_at(from_=)</span>



<span style="color: #e67e80;">if</span> <span style="color: #83c092;">__name__</span> == <span style="color: #a7c080;">"__main__"</span>:
    logger.info(f<span style="color: #a7c080;">"starting etl: </span>{ENTITY.truename}<span style="color: #a7c080;">"</span>)
    extract = Extract(amo20, method)
    extract._all()

    transform = TransformPipelines(AMO, ENTITY)
    <span style="color: #e67e80;">if</span> transform._all():
        transform.cleanup()

    load = Load(AMO, ENTITY.truename)
    load.backup()
    <span style="color: #e67e80;">if</span> load.in_batches():
        load.cleanup()
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orge6c56b6" class="outline-2">
<h2 id="orge6c56b6"><span class="section-number-2">6.</span> Shell to rule them all</h2>
<div class="outline-text-2" id="text-6">
<p>
Now, when we have defined ETL&rsquo;s for all the entities, it is time to automate the process.
Two most common tools for that are cron jobs and Airflow.
Airflow is good when you have the full orchestra of pipelines, but since we only have few processes, we&rsquo;ll use cron.
For that we&rsquo;ll create a simple script, which then we&rsquo;ll pass to crontab.
</p>
</div>
